## Importing pandas

### Getting started and checking your pandas setup

Difficulty: *easy* 

**1.** Import <b><u>pandas</u></b> under the name `pd`.

**2.** Import <b><u>numpy</u></b>  under the name `np`.

In [196]:
import pandas as pd
import numpy as np

## DataFrame basics

### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames

Difficulty: *easy*



**3.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

In [197]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [198]:
df = pd.DataFrame(data=data, index=labels)

**4.** Display a summary of the basic information about this DataFrame and its data.

In [199]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
age         8 non-null float64
animal      10 non-null object
priority    10 non-null object
visits      10 non-null int64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

**5.** Return the first 3 rows of the DataFrame `df`.

In [200]:
df.head(3)

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2

**6.** Select just the 'animal' and 'age' columns from the DataFrame `df`.

In [201]:
df.loc[:,['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**7.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.

In [202]:
df.loc[['d','e','i'],['animal','age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

**8.** Select only the rows where the number of visits is greater than 2.

In [203]:
df.loc[df['visits']>2,:]

   age animal priority  visits
b  3.0    cat      yes       3
d  NaN    dog      yes       3
f  2.0    cat       no       3

**9.** Select the rows where the age is missing, i.e. is `NaN`.

In [204]:
df.loc[df.age.isnull(),:]

   age animal priority  visits
d  NaN    dog      yes       3
h  NaN    cat      yes       1

**10.** Select the rows where the animal is a cat *and* the age is less than 3.

In [205]:
df.loc[(df.animal == 'cat') & (df.age < 3) , :]

   age animal priority  visits
a  2.5    cat      yes       1
f  2.0    cat       no       3

**11.** Select the rows the age is between 2 and 4 (inclusive).

In [206]:
df.loc[df.age.between(2,4), :]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
f  2.0    cat       no       3
j  3.0    dog       no       1

**12.** Change the age in row 'f' to 1.5.

In [207]:
df.loc['f','age'] = 1.5
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

**13.** Calculate the sum of all visits (the total number of visits).

In [208]:
sum(df.loc[:,'visits'])
df.visits.sum()

19

**14.** Calculate the mean age for each different animal in `df`.

In [209]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

**15.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [210]:
df.loc['k',:]=[2.5,'monkey','yes',5]
df
df.drop('k',axis=0,inplace=True)
df

   age animal priority  visits
a  2.5    cat      yes     1.0
b  3.0    cat      yes     3.0
c  0.5  snake       no     2.0
d  NaN    dog      yes     3.0
e  5.0    dog       no     2.0
f  1.5    cat       no     3.0
g  4.5  snake       no     1.0
h  NaN    cat      yes     1.0
i  7.0    dog       no     2.0
j  3.0    dog       no     1.0

**16.** Count the number of each type of animal in `df`.

In [211]:
df.animal.value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

**17.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visit' column in *ascending* order.

In [212]:
df.sort_values(by=['age','visits'],ascending=[False,True])

   age animal priority  visits
i  7.0    dog       no     2.0
e  5.0    dog       no     2.0
g  4.5  snake       no     1.0
j  3.0    dog       no     1.0
b  3.0    cat      yes     3.0
a  2.5    cat      yes     1.0
f  1.5    cat       no     3.0
c  0.5  snake       no     2.0
h  NaN    cat      yes     1.0
d  NaN    dog      yes     3.0

**18.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.

In [213]:
def custom_function(x):
    if x == 'yes':
        return True
    else:
        return False
    
df['new_col'] = df.priority.apply(custom_function)
df

   age animal priority  visits  new_col
a  2.5    cat      yes     1.0     True
b  3.0    cat      yes     3.0     True
c  0.5  snake       no     2.0    False
d  NaN    dog      yes     3.0     True
e  5.0    dog       no     2.0    False
f  1.5    cat       no     3.0    False
g  4.5  snake       no     1.0    False
h  NaN    cat      yes     1.0     True
i  7.0    dog       no     2.0    False
j  3.0    dog       no     1.0    False

In [214]:
df['new_col2'] = np.where(df.priority == 'yes', True, False)
df

   age animal priority  visits  new_col  new_col2
a  2.5    cat      yes     1.0     True      True
b  3.0    cat      yes     3.0     True      True
c  0.5  snake       no     2.0    False     False
d  NaN    dog      yes     3.0     True      True
e  5.0    dog       no     2.0    False     False
f  1.5    cat       no     3.0    False     False
g  4.5  snake       no     1.0    False     False
h  NaN    cat      yes     1.0     True      True
i  7.0    dog       no     2.0    False     False
j  3.0    dog       no     1.0    False     False

**19.** In the 'animal' column, change the 'snake' entries to 'python'.

In [215]:
df.animal.str.replace('snake','python')

a       cat
b       cat
c    python
d       dog
e       dog
f       cat
g    python
h       cat
i       dog
j       dog
Name: animal, dtype: object

**20.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [216]:
df.groupby(['animal','visits'])['age'].mean()

animal  visits
cat     1.0       2.50
        3.0       2.25
dog     1.0       3.00
        2.0       6.00
        3.0        NaN
snake   1.0       4.50
        2.0       0.50
Name: age, dtype: float64

In [217]:
df.pivot_table(values='age',index='animal',columns='visits',aggfunc = np.mean)

visits  1.0  2.0   3.0
animal
cat     2.5  NaN  2.25
dog     3.0  6.0   NaN
snake   4.5  0.5   NaN

## DataFrames: beyond the basics

### Slightly trickier: you may need to combine two or more methods to get the right answer

Difficulty: *medium*

The previous section was tour through some basic but essential DataFrame operations. Below are some ways that you might need to cut your data, but for which there is no single "out of the box" method.

**21.** You have a DataFrame `df` with a column 'A' of integers. For example:

How do you filter out rows which contain the same integer as the row immediately above?

In [294]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [295]:
df.loc[df.A!=df.A.shift(1), :]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

**22.** Given a DataFrame of numeric values, say


how do you subtract the row mean from each element in the row?

In [296]:
df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
df

          0         1         2
0  0.168196  0.979881  0.032927
1  0.893740  0.724820  0.567296
2  0.754852  0.789451  0.161228
3  0.481296  0.890113  0.694981
4  0.822218  0.498078  0.050629

In [297]:
df.mean(axis=1)

0    0.393668
1    0.728619
2    0.568511
3    0.688797
4    0.456975
dtype: float64

In [298]:
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0 -0.225472  0.586213 -0.360741
1  0.165122 -0.003799 -0.161323
2  0.186342  0.220941 -0.407282
3 -0.207500  0.201316  0.006184
4  0.365243  0.041103 -0.406346

**23.** Suppose you have DataFrame with 10 columns of real numbers, for example:


Which column of numbers has the smallest sum? (Find that column's label.)

In [309]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.124624,0.988281,0.622177,0.444152,0.754992,0.325048,0.292728,0.794348,0.025526,0.310732
1,0.135081,0.197524,0.983160,0.841856,0.402684,0.579053,0.572516,0.325421,0.659235,0.053278
2,0.220059,0.866097,0.030969,0.575815,0.737545,0.358254,0.547850,0.421026,0.776615,0.776693
3,0.568794,0.461858,0.623263,0.595877,0.344099,0.474186,0.240780,0.265490,0.923043,0.831865
4,0.523446,0.396474,0.658506,0.116483,0.026004,0.200958,0.077360,0.727146,0.298440,0.903562

In [310]:
df.sum().sort_values()

a    1.572003
g    1.731234
f    1.937498
e    2.265323
h    2.533431
d    2.574182
i    2.682858
j    2.876130
b    2.910234
c    2.918076
dtype: float64

**24.** Which row of numbers has the largest sum? (Find that index's label.)

In [311]:
df.sum(axis=1).sort_values(ascending=False)

3    5.329255
2    5.310922
1    4.749806
0    4.682608
4    3.928380
dtype: float64

**25.** How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

In [312]:
df = df.drop_duplicates
len(df)

TypeError: object of type 'method' has no len()

**26.** A DataFrame has a column of groups 'grps' and and column of numbers 'vals'. For example: 

For each *group*, find the sum of the three greatest values.

In [227]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
df

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [228]:
tmp = df.groupby('grps')

In [229]:
tmp['vals'].nlargest(3).sum(level=0)

grps
a    409
b    156
c    345
Name: vals, dtype: int64

## Series and DatetimeIndex

### Exercises for creating and manipulating Series with datetime data

Difficulty: *easy/medium*

**1.** Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers. Let's call this Series `s`.

In [231]:
dti = pd.date_range(start='2015-01-01', end='2015-12-31', freq='B') 
s = pd.Series(np.random.rand(len(dti)), index=dti)
s

2015-01-01    0.826557
2015-01-02    0.887214
2015-01-05    0.128511
2015-01-06    0.646303
2015-01-07    0.723408
2015-01-08    0.049925
2015-01-09    0.165737
2015-01-12    0.351581
2015-01-13    0.730004
2015-01-14    0.206717
2015-01-15    0.769532
2015-01-16    0.219216
2015-01-19    0.818651
2015-01-20    0.102691
2015-01-21    0.258779
2015-01-22    0.269112
2015-01-23    0.781121
2015-01-26    0.347397
2015-01-27    0.934553
2015-01-28    0.005248
2015-01-29    0.726692
2015-01-30    0.869564
2015-02-02    0.655079
2015-02-03    0.460306
2015-02-04    0.816357
2015-02-05    0.211852
2015-02-06    0.625560
2015-02-09    0.240209
2015-02-10    0.644393
2015-02-11    0.605261
                ...
2015-11-20    0.495649
2015-11-23    0.101450
2015-11-24    0.259279
2015-11-25    0.580712
2015-11-26    0.137680
2015-11-27    0.645271
2015-11-30    0.920008
2015-12-01    0.534400
2015-12-02    0.422131
2015-12-03    0.229218
2015-12-04    0.507603
2015-12-07    0.859056
2015-12-08    0.755020
2015-12-09    0.733266
2015-12-10    0.848235
2015-12-11    0.464524
2015-12-14    0.003215
2015-12-15    0.738087
2015-12-16    0.660410
2015-12-17    0.329226
2015-12-18    0.581051
2015-12-21    0.697053
2015-12-22    0.420992
2015-12-23    0.162612
2015-12-24    0.083680
2015-12-25    0.557512
2015-12-28    0.283215
2015-12-29    0.033377
2015-12-30    0.493742
2015-12-31    0.775366
Freq: B, Length: 261, dtype: float64

**2.** Find the sum of the values in `s` for every Wednesday.

In [232]:
s[s.index.weekday_name == 'Wednesday'].sum()

22.101671457736774

**3.** For each calendar month in `s`, find the mean of values.

In [233]:
s.resample('M').mean()

2015-01-31    0.491751
2015-02-28    0.519875
2015-03-31    0.475573
2015-04-30    0.502031
2015-05-31    0.636870
2015-06-30    0.441698
2015-07-31    0.467386
2015-08-31    0.407015
2015-09-30    0.466542
2015-10-31    0.558649
2015-11-30    0.472469
2015-12-31    0.485782
Freq: M, dtype: float64

**4.** For each group of four consecutive calendar months in `s`, find the date on which the highest value occurred.

In [234]:
s.resample('4M').max()

2015-01-31    0.934553
2015-05-31    0.994582
2015-09-30    0.986032
2016-01-31    0.979814
Freq: 4M, dtype: float64

**5.** Create a DateTimeIndex consisting of the third Thursday in each month for the years 2015 and 2016.

In [235]:
pd.date_range('2015-01-01','2016-12-31',freq='WOM-3THU')

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')

## Cleaning Data

### Making a DataFrame easier to work with

Difficulty: *easy/medium*

In [283]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

**1.** Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [284]:
df.FlightNumber = df.FlightNumber.interpolate().astype(int)
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

**2.** The From\_To column would be better as two separate columns! Split each string on the underscore delimiter `_` to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [285]:
tmp = df.From_To.str.split('_',expand=True,)
tmp.columns = ['From','To']
tmp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

**3.** Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [287]:
tmp['From'] = tmp['From'].str.capitalize()
tmp['To'] = tmp['To'].str.capitalize()
tmp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

**5.** Delete the From_To column from `df` and attach the temporary DataFrame from the previous questions.

In [288]:
df.drop('From_To',axis=1,inplace=True)
df

               Airline  FlightNumber  RecentDelays
0               KLM(!)         10045      [23, 47]
1    <Air France> (12)         10055            []
2  (British Airways. )         10065  [24, 43, 87]
3       12. Air France         10075          [13]
4          "Swiss Air"         10085      [67, 32]

In [289]:
df = pd.concat([df,tmp],axis=1)
df

               Airline  FlightNumber  RecentDelays      From         To
0               KLM(!)         10045      [23, 47]    London      Paris
1    <Air France> (12)         10055            []    Madrid      Milan
2  (British Airways. )         10065  [24, 43, 87]    London  Stockholm
3       12. Air France         10075          [13]  Budapest      Paris
4          "Swiss Air"         10085      [67, 32]  Brussels     London

**6**. In the Airline column, you can see some extra puctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. `'(British Airways. )'` should become `'British Airways'`.

In [290]:
df['Airline'] = df['Airline'].str.extract('([a-zA-Z\s]+)', expand=False).str.strip()
df

           Airline  FlightNumber  RecentDelays      From         To
0              KLM         10045      [23, 47]    London      Paris
1       Air France         10055            []    Madrid      Milan
2  British Airways         10065  [24, 43, 87]    London  Stockholm
3       Air France         10075          [13]  Budapest      Paris
4        Swiss Air         10085      [67, 32]  Brussels     London

## Plotting

### Visualize trends and patterns in data

Difficulty: *medium*

**1.** Pandas is highly integrated with the plotting library matplotlib, and makes plotting DataFrames very user-friendly! Plotting in a notebook environment usually makes use of the following boilerplate:

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
plt.style.use('ggplot')

df = pd.DataFrame({"xs":[1,5,2,8,1], "ys":[4,2,1,9,6]})
df

   xs  ys
0   1   4
1   5   2
2   2   1
3   8   9
4   1   6

**2.** Columns in your DataFrame can also be used to modify colors and sizes.  Bill has been keeping track of his performance at work over time, as well as how good he was feeling that day, and whether he had a cup of coffee in the morning.  Make a plot which incorporates all four features of this DataFrame.

In [115]:
df = pd.DataFrame({"productivity":[5,2,3,1,4,5,6,7,8,3,4,8,9],
                   "hours_in"    :[1,9,6,5,3,9,2,9,1,7,4,2,2],
                   "happiness"   :[2,1,3,2,3,1,2,3,1,2,2,1,3],
                   "caffienated" :[0,0,1,1,0,0,0,0,1,1,0,1,0]})
df

    caffienated  happiness  hours_in  productivity
0             0          2         1             5
1             0          1         9             2
2             1          3         6             3
3             1          2         5             1
4             0          3         3             4
5             0          1         9             5
6             0          2         2             6
7             0          3         9             7
8             1          1         1             8
9             1          2         7             3
10            0          2         4             4
11            1          1         2             8
12            0          3         2             9

**3.**  What if we want to plot multiple things?  Pandas allows you to pass in a matplotlib *Axis* object for plots, and plots will also return an Axis object.

Make a bar plot of monthly revenue with a line plot of monthly advertising spending (numbers in millions)

In [117]:
df = pd.DataFrame({"revenue":[57,68,63,71,72,90,80,62,59,51,47,52],
                   "advertising":[2.1,1.9,2.7,3.0,3.6,3.2,2.7,2.4,1.8,1.6,1.3,1.9],
                   "month":range(12)
                  })
df

    advertising  month  revenue
0           2.1      0       57
1           1.9      1       68
2           2.7      2       63
3           3.0      3       71
4           3.6      4       72
5           3.2      5       90
6           2.7      6       80
7           2.4      7       62
8           1.8      8       59
9           1.6      9       51
10          1.3     10       47
11          1.9     11       52